chcbaram/Teensy41/teensy4_fw/src/lib/config/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* iomuxc clock (iomuxc_clk_enable): 0x03U */

  /* GPIO configuration on GPIO_AD_B0_02 (pin M11) */
  gpio_pin_config_t gpio1_pinM11_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B0_02 (pin M11) */
  GPIO_PinInit(GPIO1, 2U, &gpio1_pinM11_config);

  /* GPIO configuration on GPIO_B0_00 (pin D7) */
  gpio_pin_config_t gpio2_pinD7_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B0_00 (pin D7) */
  GPIO_PinInit(GPIO2, 0U, &gpio2_pinD7_config);

  /* GPIO configuration on GPIO_B0_01 (pin E7) */
  gpio_pin_config_t gpio2_pinE7_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B0_01 (pin E7) */
  GPIO_PinInit(GPIO2, 1U, &gpio2_pinE7_config);

  /* GPIO configuration on GPIO_B0_03 (pin D8) */
  gpio_pin_config_t gpio2_pinD8_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B0_03 (pin D8) */
  GPIO_PinInit(GPIO2, 3U, &gpio2_pinD8_config);

  /* GPIO configuration on GPIO_B0_10 (pin D9) */
  gpio_pin_config_t gpio2_pinD9_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B0_10 (pin D9) */
  GPIO_PinInit(GPIO2, 10U, &gpio2_pinD9_config);

  /* GPIO configuration on GPIO_B0_11 (pin A10) */
  gpio_pin_config_t gpio2_pinA10_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B0_11 (pin A10) */
  GPIO_PinInit(GPIO2, 11U, &gpio2_pinA10_config);

  /* GPIO configuration on GPIO_B1_00 (pin A11) */
  gpio_pin_config_t gpio2_pinA11_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_00 (pin A11) */
  GPIO_PinInit(GPIO2, 16U, &gpio2_pinA11_config);

  /* GPIO configuration on GPIO_EMC_32 (pin D5) */
  gpio_pin_config_t gpio3_pinD5_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_32 (pin D5) */
  GPIO_PinInit(GPIO3, 18U, &gpio3_pinD5_config);

  /* GPIO configuration on GPIO_EMC_05 (pin G5) */
  gpio_pin_config_t gpio4_pinG5_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_05 (pin G5) */
  GPIO_PinInit(GPIO4, 5U, &gpio4_pinG5_config);

  /* GPIO configuration on GPIO_EMC_06 (pin H5) */
  gpio_pin_config_t gpio4_pinH5_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_06 (pin H5) */
  GPIO_PinInit(GPIO4, 6U, &gpio4_pinH5_config);

  /* GPIO configuration on GPIO_EMC_07 (pin H4) */
  gpio_pin_config_t gpio4_pinH4_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_07 (pin H4) */
  GPIO_PinInit(GPIO4, 7U, &gpio4_pinH4_config);

  /* GPIO configuration on GPIO_EMC_08 (pin H3) */
  gpio_pin_config_t gpio4_pinH3_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_08 (pin H3) */
  GPIO_PinInit(GPIO4, 8U, &gpio4_pinH3_config);

  /* GPIO configuration on GPIO_EMC_31 (pin C5) */
  gpio_pin_config_t gpio4_pinC5_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_31 (pin C5) */
  GPIO_PinInit(GPIO4, 31U, &gpio4_pinC5_config);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B0_02_GPIO1_IO02,        /* GPIO_AD_B0_02 is configured as GPIO1_IO02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B1_00_FLEXIO3_FLEXIO00,  /* GPIO_AD_B1_00 is configured as FLEXIO3_FLEXIO00 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B1_00 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B1_01_FLEXIO3_FLEXIO01,  /* GPIO_AD_B1_01 is configured as FLEXIO3_FLEXIO01 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B1_01 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B1_02_FLEXIO3_FLEXIO02,  /* GPIO_AD_B1_02 is configured as FLEXIO3_FLEXIO02 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B1_02 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B1_03_FLEXIO3_FLEXIO03,  /* GPIO_AD_B1_03 is configured as FLEXIO3_FLEXIO03 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B1_03 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B1_04_FLEXIO3_FLEXIO04,  /* GPIO_AD_B1_04 is configured as FLEXIO3_FLEXIO04 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B1_04 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B1_05_FLEXIO3_FLEXIO05,  /* GPIO_AD_B1_05 is configured as FLEXIO3_FLEXIO05 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B1_05 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B1_06_FLEXIO3_FLEXIO06,  /* GPIO_AD_B1_06 is configured as FLEXIO3_FLEXIO06 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B1_06 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B1_07_FLEXIO3_FLEXIO07,  /* GPIO_AD_B1_07 is configured as FLEXIO3_FLEXIO07 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B1_07 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B1_08_FLEXIO3_FLEXIO08,  /* GPIO_AD_B1_08 is configured as FLEXIO3_FLEXIO08 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B1_08 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B1_12_FLEXIO3_FLEXIO12,  /* GPIO_AD_B1_12 is configured as FLEXIO3_FLEXIO12 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B1_12 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B0_00_GPIO2_IO00,           /* GPIO_B0_00 is configured as GPIO2_IO00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B0_01_GPIO2_IO01,           /* GPIO_B0_01 is configured as GPIO2_IO01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B0_03_GPIO2_IO03,           /* GPIO_B0_03 is configured as GPIO2_IO03 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B0_10_GPIO2_IO10,           /* GPIO_B0_10 is configured as GPIO2_IO10 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B0_11_GPIO2_IO11,           /* GPIO_B0_11 is configured as GPIO2_IO11 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B1_00_GPIO2_IO16,           /* GPIO_B1_00 is configured as GPIO2_IO16 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_05_GPIO4_IO05,          /* GPIO_EMC_05 is configured as GPIO4_IO05 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_06_GPIO4_IO06,          /* GPIO_EMC_06 is configured as GPIO4_IO06 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_07_GPIO4_IO07,          /* GPIO_EMC_07 is configured as GPIO4_IO07 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_08_GPIO4_IO08,          /* GPIO_EMC_08 is configured as GPIO4_IO08 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_22_FLEXSPI2_A_SS1_B,    /* GPIO_EMC_22 is configured as FLEXSPI2_A_SS1_B */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_22 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_23_FLEXSPI2_A_DQS,      /* GPIO_EMC_23 is configured as FLEXSPI2_A_DQS */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_23 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_24_FLEXSPI2_A_SS0_B,    /* GPIO_EMC_24 is configured as FLEXSPI2_A_SS0_B */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_24 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_25_FLEXSPI2_A_SCLK,     /* GPIO_EMC_25 is configured as FLEXSPI2_A_SCLK */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_25 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_26_FLEXSPI2_A_DATA00,   /* GPIO_EMC_26 is configured as FLEXSPI2_A_DATA00 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_26 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_27_FLEXSPI2_A_DATA01,   /* GPIO_EMC_27 is configured as FLEXSPI2_A_DATA01 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_27 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_28_FLEXSPI2_A_DATA02,   /* GPIO_EMC_28 is configured as FLEXSPI2_A_DATA02 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_28 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_29_FLEXSPI2_A_DATA03,   /* GPIO_EMC_29 is configured as FLEXSPI2_A_DATA03 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_29 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_31_GPIO4_IO31,          /* GPIO_EMC_31 is configured as GPIO4_IO31 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_32_GPIO3_IO18,          /* GPIO_EMC_32 is configured as GPIO3_IO18 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B0_00_USDHC1_CMD,        /* GPIO_SD_B0_00 is configured as USDHC1_CMD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B0_01_USDHC1_CLK,        /* GPIO_SD_B0_01 is configured as USDHC1_CLK */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B0_02_USDHC1_DATA0,      /* GPIO_SD_B0_02 is configured as USDHC1_DATA0 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B0_03_USDHC1_DATA1,      /* GPIO_SD_B0_03 is configured as USDHC1_DATA1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B0_04_USDHC1_DATA2,      /* GPIO_SD_B0_04 is configured as USDHC1_DATA2 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B0_05_USDHC1_DATA3,      /* GPIO_SD_B0_05 is configured as USDHC1_DATA3 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_GPR->GPR26 = ((IOMUXC_GPR->GPR26 &
    (~(IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL_MASK))) /* Mask bits to zero which are setting */
      | IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL(0x00U) /* GPIO1 and GPIO6 share same IO MUX function, GPIO_MUX1 selects one GPIO function: 0x00U */
    );
  IOMUXC_GPR->GPR27 = ((IOMUXC_GPR->GPR27 &
    (~(IOMUXC_GPR_GPR27_GPIO_MUX2_GPIO_SEL_MASK))) /* Mask bits to zero which are setting */
      | IOMUXC_GPR_GPR27_GPIO_MUX2_GPIO_SEL(0x00U) /* GPIO2 and GPIO7 share same IO MUX function, GPIO_MUX2 selects one GPIO function: 0x00U */
    );
  IOMUXC_GPR->GPR28 = ((IOMUXC_GPR->GPR28 &
    (~(IOMUXC_GPR_GPR28_GPIO_MUX3_GPIO_SEL_MASK))) /* Mask bits to zero which are setting */
      | IOMUXC_GPR_GPR28_GPIO_MUX3_GPIO_SEL(0x00U) /* GPIO3 and GPIO8 share same IO MUX function, GPIO_MUX3 selects one GPIO function: 0x00U */
    );
  IOMUXC_GPR->GPR29 = ((IOMUXC_GPR->GPR29 &
    (~(IOMUXC_GPR_GPR29_GPIO_MUX4_GPIO_SEL_MASK))) /* Mask bits to zero which are setting */
      | IOMUXC_GPR_GPR29_GPIO_MUX4_GPIO_SEL(0x00U) /* GPIO4 and GPIO9 share same IO MUX function, GPIO_MUX4 selects one GPIO function: 0x00U */
    );
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_B1_00_FLEXIO3_FLEXIO00,  /* GPIO_AD_B1_00 PAD functional properties : */
      0x70B1U);                               /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Pull
                                                 Pull Up / Down Config. Field: 47K Ohm Pull Up
                                                 Hyst. Enable Field: Hysteresis Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_B1_01_FLEXIO3_FLEXIO01,  /* GPIO_AD_B1_01 PAD functional properties : */
      0x70B1U);                               /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Pull
                                                 Pull Up / Down Config. Field: 47K Ohm Pull Up
                                                 Hyst. Enable Field: Hysteresis Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_B1_02_FLEXIO3_FLEXIO02,  /* GPIO_AD_B1_02 PAD functional properties : */
      0x70B1U);                               /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Pull
                                                 Pull Up / Down Config. Field: 47K Ohm Pull Up
                                                 Hyst. Enable Field: Hysteresis Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_B1_03_FLEXIO3_FLEXIO03,  /* GPIO_AD_B1_03 PAD functional properties : */
      0x70B1U);                               /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Pull
                                                 Pull Up / Down Config. Field: 47K Ohm Pull Up
                                                 Hyst. Enable Field: Hysteresis Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_B1_04_FLEXIO3_FLEXIO04,  /* GPIO_AD_B1_04 PAD functional properties : */
      0x70B1U);                               /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
